project03/app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "name", "password_digest", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "980190962"]]
UPDATE "users" SET "updated_at" = '2012-02-05 20:35:48.818221', "name" = 'Thomas', "password_digest" = '$2a$10$/6FYRnjsIEuKuV2CT9hJVOtJXny1WsvW3Nah5uZ4NB8G/RcQp/NCC' WHERE "users"."id" = 980190962
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "980190962"]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 980190962]]
---
  def destroy
    @user = User.find(params[:id])
    begin
      @user.destroy