project03/depot/app/views/carts/_cart.html.erb

SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = 980190962
SELECT COUNT(*) FROM "line_items" WHERE "line_items"."cart_id" = 980190962
---
<% unless cart.line_items.empty? %>