project03/depot/app/controllers/line_items_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? ORDER BY title LIMIT 1  [["id", "106995957"]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Sat, 04 Feb 2012 02:28:32 UTC +00:00], ["updated_at", Sat, 04 Feb 2012 02:28:32 UTC +00:00]]
INSERT INTO "line_items" ("cart_id", "created_at", "order_id", "product_id", "quantity", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["cart_id", 980190963], ["created_at", Sun, 05 Feb 2012 02:18:45 UTC +00:00], ["order_id", nil], ["product_id", 106995957], ["quantity", 1], ["updated_at", Sun, 05 Feb 2012 02:18:45 UTC +00:00]]
UPDATE "line_items" SET "updated_at" = '2012-02-04 23:51:59.954175', "quantity" = 2 WHERE "line_items"."id" = 9
---
  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save